#+title: Test

#+begin_src emacs-lisp :tangle yes
  (mason--pipe-to-proc "fun1arg2 | fun1(fun1arg1) | fun2 fun2arg1 | fun3")
#+end_src

#+RESULTS:
: fun3(fun2(fun2arg1, fun1(fun1arg1, fun1arg2)))


#+begin_src emacs-lisp :tangle yes
  (mason--proc-to-sexp "fun1(fun1arg1, fun2(fun2arg1, 'str1', \"str2\", fun3()))")
#+end_src

#+RESULTS:
: (fun1 fun1arg1 (fun2 fun2arg1 "str1" "str2" (fun3)))


#+begin_src emacs-lisp :tangle yes
  (mason--expand
   "abc-{{version}}"
   (mason--make-hash "version" "1.2.3"))
#+end_src

#+RESULTS:
: abc-1.2.3


#+begin_src emacs-lisp :tangle yes
  (mason--expand
   "abc-{{ version                       }}"
   (mason--make-hash "version" "1.2.3"))
#+end_src

#+RESULTS:
: abc-1.2.3


#+begin_src emacs-lisp :tangle yes
  (mason--expand
   "abc-{{ version | strip_prefix \"v\"}}"
   (mason--make-hash "version" "v1.2.3"))
#+end_src

#+RESULTS:
: abc-1.2.3


#+begin_src emacs-lisp :tangle yes
  (mason--expand
   "{{some.nested.path | strip_prefix \"no \"}} it works"
   (mason--make-hash
     "some" (mason--make-hash
             "nested" (mason--make-hash
                       "path" "no yes"))))
#+end_src

#+RESULTS:
: yes it works


#+begin_src emacs-lisp :tangle yes
  (let (msg)
    (mason-dry-run-install-all
     (lambda (a b)
       (setq msg (format "Installed %d/%d packages" a b))))
    (while (not msg)
      (accept-process-output nil 0.01))
    msg)
#+end_src

#+RESULTS:
: Installed 562/563 packages


#+begin_src emacs-lisp :tangle yes
  (let* ((str
          '("pkg:bitbucket/birkenfeld/pygments-main@244fd47e07d1014f0aed9c"
            "pkg:deb/debian/curl@7.50.3-1?arch=i386&distro=jessie"
            "pkg:docker/cassandra@sha256:244fd47e07d1004f0aed9c"
            "pkg:docker/customer/dockerimage@sha256:244fd47e07d1004f0aed9c?repository_url=gcr.io"
            "pkg:gem/jruby-launcher@1.1.2?platform=java"
            "pkg:gem/ruby-advisory-db-check@0.12.4"
            "pkg:github/package-url/purl-spec@244fd47e07d1004f0aed9c"
            "pkg:golang/google.golang.org/genproto#googleapis/api/annotations"
            "pkg:maven/org.apache.xmlgraphics/batik-anim@1.9.1?packaging=sources"
            "pkg:maven/org.apache.xmlgraphics/batik-anim@1.9.1?repository_url=repo.spring.io/release"
            "pkg:npm/%40angular/animation@12.3.1"
            "pkg:npm/foobar@12.3.1"
            "pkg:nuget/EnterpriseLibrary.Common@6.0.1304"
            "pkg:pypi/django@1.11.1"
            "pkg:rpm/fedora/curl@7.50.3-1.fc25?arch=i386&distro=fedora-25"
            "pkg:rpm/opensuse/curl@7.56.1-1.1.?arch=i386&distro=opensuse-tumbleweed"))
         (purls (mapcar #'mason--parse-purl str)))
    (with-temp-buffer
      (insert "scheme type namespace name version qualifiers subpath\n")
      (dolist (purl purls)
        (insert (or (gethash "scheme" purl) "nil") ?\s
                (or (gethash "type" purl) "nil") ?\s
                (or (gethash "namespace" purl) "nil") ?\s
                (or (gethash "name" purl) "nil") ?\s
                (or (gethash "version" purl) "nil") ?\s
                (if (gethash "qualifiers" purl)
                    (json-serialize (gethash "qualifiers" purl))
                  "nil")
                ?\s
                (or (gethash "subpath" purl) "nil") ?\n))
      (text-mode)
      (align (point-min) (point-max))
      (buffer-string)))
#+end_src

#+RESULTS:
#+begin_example
scheme type      namespace              name                     version                       qualifiers                                     subpath
pkg    bitbucket birkenfeld             pygments-main            244fd47e07d1014f0aed9c        nil                                            nil
pkg    deb       debian                 curl                     7.50.3-1                      {"distro":"jessie","arch":"i386"}              nil
pkg    docker    nil                    cassandra                sha256:244fd47e07d1004f0aed9c nil                                            nil
pkg    docker    customer               dockerimage              sha256:244fd47e07d1004f0aed9c {"repository_url":"gcr.io"}                    nil
pkg    gem       nil                    jruby-launcher           1.1.2                         {"platform":"java"}                            nil
pkg    gem       nil                    ruby-advisory-db-check   0.12.4                        nil                                            nil
pkg    github    package-url            purl-spec                244fd47e07d1004f0aed9c        nil                                            nil
pkg    golang    google.golang.org      genproto                 nil                           nil                                            googleapis/api/annotations
pkg    maven     org.apache.xmlgraphics batik-anim               1.9.1                         {"packaging":"sources"}                        nil
pkg    maven     org.apache.xmlgraphics batik-anim               1.9.1                         {"repository_url":"repo.spring.io/release"}    nil
pkg    npm       @angular               animation                12.3.1                        nil                                            nil
pkg    npm       nil                    foobar                   12.3.1                        nil                                            nil
pkg    nuget     nil                    EnterpriseLibrary.Common 6.0.1304                      nil                                            nil
pkg    pypi      nil                    django                   1.11.1                        nil                                            nil
pkg    rpm       fedora                 curl                     7.50.3-1.fc25                 {"distro":"fedora-25","arch":"i386"}           nil
pkg    rpm       opensuse               curl                     7.56.1-1.1.                   {"distro":"opensuse-tumbleweed","arch":"i386"} nil
#+end_example
